{
    "Fechar":"Close",
    "Saber Mais":"Learn More",
    "Website":"Website",
    "Localização":"Location",
    "Contactar":"Contact",

    "Perfil Profissional":"Professional Profile",
    "Sobre Mim":"About Me",

    "Habilidades":"Skills",
    "Linguagem de marcação usada para estruturar páginas web.":"Markup language used to structure web pages.",
    "Estiliza visualmente as páginas HTML.":"Visually styles HTML pages.",
    "Linguagem de programação usada para interatividade no frontend.":"Programming language used for interactivity on the frontend.",
    "Linguagem de script do lado do servidor usada para desenvolver aplicações web.":"Server-side scripting language used to develop web applications.",
    "Framework para construir aplicações móveis e web com tecnologias web como HTML, CSS e JavaScript.":"Framework for building mobile and web applications with web technologies such as HTML, CSS and JavaScript.",
    
    "Idiomas":"Languages",
    "Português":"Portuguese",
    "Fluente (Nativo)":"Fluent (Native)",
    "Inglês":"English",
    "Intermédio":"Intermediate",
    "Francês":"French",
    "Básico":"Basic",

    "Educação":"Education",    
    "Ensino Secundário":"Secondary Education",
    "Escola:":"School:",
    "Escola Básica e Secundária de Barroselas":"Barroselas Basic and Secondary School",
    "Tipo de Ensino:":"Type of Education:",
    "Ensino Regular":"Regular Education",
    "Curso:":"Course:",
    "Ciências e Tecnologias":"Science and Technologies",
    "Iniciado em:":"Started in:",
    "Setembro de 2018":"September 2018",
    "Concluído em:":"Completed in:",
    "Julho de 2021":"July 2021",
    "Ensino Superior Profissional":"Higher Professional Education",
    "Escola Superior de Tecnologia e Gestão [IPVC]":"Higher School of Technology and Management [IPVC]",
    "Curso Técnico Superior Profissional (CTeSP)":"Higher Professional Technical Course (CTeSP)",
    "Desenvolvimento Web e Multimédia":"Web and Multimedia Development",
    "Setembro de 2021":"September 2021",
    "Junho de 2023":"June 2023",
    "Ensino Superior":"Higher Education",
    "Licenciatura":"Degree",
    "Engenharia da Computação Gráfica e Multimédia":"Computer Graphics and Multimedia Engineering",
    "Setembro de 2023":"September 2023",
    "[Por Concluir]":"[To Conclude]",
    "Projetos":"Projects",
    "Roteiros Vianenses":"Vianense Routes",
    "Projeto concluído":"Completed project",
    "O Projeto Roteiros Vianenses encontra-se finalizado e teve como objetivo final ser uma plataforma que possibilite aos utilizadores rotas turísticas pelos diferentes locais do distrito de Viana do Castelo, bem como dar informações de locais com possível interesse de serem visitados entre muito mais.":"O Vianense Routes Project is completed and aimed to be a platform that allows users to explore tourist routes in different locations in the district of Viana do Castelo, as well as provide information on places of possible interest to visit among much more.",

    "Redes Sociais":"Social Networks",


    "Informações Úteis":"Useful Information",
    "Informações Gerais":"General Information",
    "Área":"Area",
    "População":"Population",
    "Aproximadamente 85.000 habitantes":"Approximately 85,000 inhabitants",
    "Clima":"Climate",
    "Mediterrânico com influência oceânica":"Mediterranean with oceanic influence",
    "Distrito":"District",
    "Freguesias":"Parishes",
    "Destaques para o arroz de sarrabulho, lampreia à moda do Minho e os famosos doces como as “Bolas de Berlim”.":"Highlights include sarrabulho rice, lamprey in the Minho style and the famous sweets such as “Berlin Balls”.",
    "Economia":"Economy",
    "Forte presença da indústria naval, têxtil e tecnológica. É também um centro de exportação relevante no Norte de Portugal.":"Strong presence of the naval, textile and technology industries. It is also a relevant export center in Northern Portugal.",
    "Eventos e Festas":"Events and Festivals",
    "Viana do Castelo tem uma grande variedade de eventos e festas durante todo o ano. Clica abaixo para consultares a agenda diretamente na página da cidade.":"Viana do Castelo has a wide variety of events and festivals throughout the year. Click below to check the agenda directly on the city page.",
    "Consultar Eventos e Festas":"Check Events and Festivals",
    "Abrir na App Mapas":"Open in Maps App",


    "Gastronomia":"Gastronomy",
    "Sabores de Viana":"Flavors of Viana",
    "Tradição e Sabor":"Tradition and Flavor",
    "Viana do Castelo é um destino gastronómico de excelência. Com pratos únicos, doces conventuais e produtos locais, cada refeição é uma viagem ao coração da tradição minhota.":"Viana do Castelo is a gastronomic destination of excellence. With unique dishes, conventual sweets and local products, each meal is a journey to the heart of Minho tradition.",
    "Pratos Típicos":"Typical Dishes",
    "Arroz de Sarrabulho":"Sarrabulho Rice",
    "Com carne de porco e sangue coagulado, servido com rojões.":"With pork and coagulated blood, served with rojões.",
    "Bacalhau à Viana":"Bacalhau Viana",
    "Bacalhau frito com cebolada rica em azeite, acompanhado de batata frita às rodelas.":"Fried cod with onion rich in olive oil, accompanied by sliced fried potatoes.",
    "Polvo à Lagareiro":"Octopus Lagareiro",
    "Polvo assado no forno com azeite, alho e batatas a murro — um clássico do Minho.":"Baked octopus with olive oil, garlic and smashed potatoes - a classic from Minho.",
    "Rojões à Minhota":"Minho Rojões",
    "Carne de porco frita em vinha-d’alhos, servida com papas de sarrabulho, batatas e grelos.":"Fried pork marinated in garlic and wine, served with blood pudding porridge, potatoes, and turnip greens.",
    "Doces Regionais":"Regional Sweets",
    "Bolas de Berlim":"Berlin Balls",
    "Versão local das tradicionais bolas, muito apreciadas na região.":"Local version of the traditional balls, much appreciated in the region.",
    "Torta de Viana":"Viana Cake",
    "Doce conventual enrolado com recheio de creme.":"Conventual sweet rolled with cream filling.",
    "Pudim Abade de Priscos":"Abade de Priscos Pudding",
    "Rico e doce, tradicional do Minho e popular em Viana.":"Rich and sweet, traditional from Minho and popular in Viana.",
    "Produtos Locais":"Local Products",
    "Vinho Verde":"Green Wine",
    "Fresco e leve, acompanha na perfeição os pratos da região.":"Fresh and light, perfectly accompanies the dishes of the region.",
    "Mel do Minho":"Minho Honey",
    "Produzido nas serras vizinhas, ideal para doces e infusões.":"Produced in the neighboring mountains, ideal for sweets and infusions.",

    "Alojamento":"Accommodation",
    "Pousada de Viana do Castelo":"Viana do Castelo Pousada",
    "Monte de Santa Luzia":"Monte de Santa Luzia",
    "Vista deslumbrante sobre a cidade e o mar, ideal para uma estadia relaxante em ambiente histórico.":"Stunning view of the city and the sea, ideal for a relaxing stay in a historic environment.",
    "Hotel Flor de Sal":"Flor de Sal Hotel",
    "Frente ao mar":"Sea Front",
    "Moderno e confortável, com spa e acesso direto ao mar.":"Modern and comfortable, with spa and direct access to the sea.",
    "Casa Melo Alvim":"Melo Alvim House",
    "Centro histórico":"Historic Center",
    "Antigo solar restaurado, combina charme clássico com conforto moderno.":"Restored old manor house, combining classic charm with modern comfort.",
    "Absoluto Design Hotel":"Absolute Design Hotel",
    "Design moderno":"Modern Design",
    "Hotel boutique com design contemporâneo e detalhes sofisticados.":"Boutique hotel with contemporary design and sophisticated details.",
    "Hotel Rali":"Rali Hotel",
    "Perto do centro":"Near the center",
    "Alojamento confortável com restaurante e estacionamento gratuito.":"Comfortable accommodation with restaurant and free parking.",
    "Hotel do Parque":"Park Hotel",
    "Zona tranquila":"Quiet area",
    "Envolto em natureza, ideal para relaxar com ambiente familiar.":"Surrounded by nature, ideal for relaxing in a family atmosphere.",
    "Axis Viana Business & SPA":"Axis Viana Business & SPA",
    "Moderno e com spa":"Modern and with spa",
    "Hotel 4 estrelas com piscina interior, spa e vistas panorâmicas.":"4-star hotel with indoor pool, spa and panoramic views.",


    "Pontos Turísticos":"Tourist Points",
    "Santuário de Santa Luzia":"Santa Luzia Sanctuary",
    "Vista panorâmica sobre a cidade e mar.":"Panoramic view of the city and sea.",
    "O Santuário do Sagrado Coração de Jesus, também conhecido como Santa Luzia, é uma das mais belas igrejas de Portugal. Construído no século XX, oferece uma das melhores vistas do país, acessível por estrada ou funicular.":"The Sanctuary of the Sacred Heart of Jesus, also known as Santa Luzia, is one of the most beautiful churches in Portugal. Built in the 20th century, it offers one of the best views in the country, accessible by road or funicular.",
    "Navio Gil Eannes":"Gil Eannes Ship",
    "Navio hospital convertido em museu.":"Hospital ship converted into a museum.",
    "O Navio Gil Eannes serviu como navio hospital da frota bacalhoeira nos mares da Terra Nova. Hoje está ancorado em Viana do Castelo e funciona como museu, oferecendo uma visita única à história marítima portuguesa.":"The Gil Eannes Ship served as a hospital ship for the cod fleet in the waters of Newfoundland. Today it is anchored in Viana do Castelo and operates as a museum, offering a unique visit to Portuguese maritime history.",
    "Igreja da Misericórdia":"Church of Mercy",
    "Igreja renascentista do século XVI.":"XVI century Renaissance church.",
    "Construída em 1589, a Igreja da Misericórdia é uma joia da arquitetura renascentista e barroca. A sua fachada é única em Portugal, com três andares de arcadas sobre colunas toscanas e jónicas.":"Built in 1589, the Church of Mercy is a jewel of Renaissance and Baroque architecture. Its facade is unique in Portugal, with three floors of arcades on Tuscan and Ionic columns.",
    "Castelo de Santiago da Barra":"Castle of Santiago da Barra",
    "Fortificação costeira do século XV.":"XV century coastal fortification.",
    "Este castelo teve um papel defensivo crucial na proteção da cidade contra invasores marítimos. Hoje em dia é um local histórico com vista para o porto e para o mar.":" This castle played a crucial defensive role in protecting the city from maritime invaders. Nowadays it is a historic site overlooking the port and the sea.",
    "Museu de Artes Decorativas":"Museum of Decorative Arts",
    "Museu com coleção de faiança e mobiliário.":"Museum with a collection of pottery and furniture.",
    "Instalado num solar do século XVIII, o museu contém valiosas coleções de faiança portuguesa, mobiliário e arte sacra. Um ponto imperdível para os amantes da arte.":"Housed in an 18th century manor house, the museum contains valuable collections of Portuguese pottery, furniture and sacred art. A must-see for art lovers.",
    "Praia do Cabedelo":"Cabedelo Beach",
    "Praia ideal para surf e desportos náuticos.":"Beach ideal for surfing and water sports.",
    "A Praia do Cabedelo é famosa pelas ótimas condições para a prática de surf, windsurf e kitesurf. Possui areias douradas e uma atmosfera descontraída, muito apreciada tanto por locais quanto por visitantes.":"Cabedelo Beach is famous for its great conditions for surfing, windsurfing and kitesurfing. It has golden sands and a relaxed atmosphere, much appreciated by both locals and visitors.",


    "Clubes Desportivos":"Sports Clubs",
    "Modalidades":"Modalities",
    "Futebol, Judo, Dança Desportiva, Ténis de Mesa, Bilhar, etc":"Football, Judo, Sports Dance, Table Tennis, Billiards, etc",
    "Clube histórico fundado em 1898, o mais antigo de Portugal.":"Historic club founded in 1898, the oldest in Portugal.",
    "Principalmente conhecido pelo futebol, mas também promove outras modalidades como judo, dança desportiva, bilhar e automobilismo.":"Mainly known for football, but also promotes other modalities such as judo, sports dance, billiards and motorsport.",
    "Futebol:":"Football",
    "Clube dedicado ao futebol amador, sediado em Vila de Punhe. Participa em competições regionais e é importante na formação de jovens atletas.":"Club dedicated to amateur football, based in Vila de Punhe. Participates in regional competitions and is important in the training of young athletes.",
    "Promove o desporto e a inclusão social na comunidade.":"Promotes sport and social inclusion in the community.",
    "Diversas, incluindo Futebol":"Various, including Football",
    "Fundado em 2010, aposta na formação desportiva de jovens em várias modalidades, com forte presença no futebol regional.":"Founded in 2010, it focuses on the sports training of young people in various modalities, with a strong presence in regional football.",
    "Futebol, Atletismo, Xadrez, Basquetebol, Ciclismo, Andebol e Pesca":"Football, Athletics, Chess, Basketball, Cycling, Handball and Fishing",
    "Multidesportivo e com grande tradição local, nasceu com foco no futebol e expandiu-se para modalidades como ciclismo, basquetebol, pesca e xadrez.":"Multisport and with great local tradition, it was born with a focus on football and expanded to modalities such as cycling, basketball, fishing and chess.",
    "Hóquei em patins":"Roller hockey",
    "Clube de referência nacional em hóquei em patins. Conhecido pela formação e participação em campeonatos de topo.":"National reference club in roller hockey. Known for training and participating in top championships.",
    "Hóquei em patins, esgrima, ginástica, patinagem, trail, triatlo e padel":"Roller hockey, fencing, gymnastics, skating, trail, triathlon and padel",
    "Promove o ténis e o padel com campos próprios e eventos regulares. Destaca-se pelo trabalho na formação e na organização de torneios locais.":"Promotes tennis and padel with its own courts and regular events. It stands out for its work in training and organizing local tournaments.",
    "Tiro Olímpico, Tiro IPSC e Field Targer":"Olympic Shooting, IPSC Shooting and Field Target",
    "Fundada em 1925, é o principal clube de tiro desportivo da região. Organiza provas oficiais e sessões de treino para várias disciplinas de tiro.":"Founded in 1925, it is the main sports shooting club in the region. It organizes official competitions and training sessions for various shooting disciplines.",
    "Basquetebol":"Basketball",
    "Dedicado exclusivamente ao basquetebol, com equipas de formação e séniores. Incentiva a prática da modalidade entre jovens.":"Dedicated exclusively to basketball, with training and senior teams. Encourages the practice of the sport among young people.",
    "Canoagem":"Canoeing",
    "Clube vocacionado para a canoagem, com forte presença em competições nacionais. Atua também na formação e promoção do desporto náutico.":"Club focused on canoeing, with a strong presence in national competitions. It also works in training and promoting water sports.",
    "Vela":"Sailing",
    "Clube especializado em remo, com uma equipa competitiva e formação regular. Tem tradição no rio Lima.":"Club specialized in rowing, with a competitive team and regular training. It has a tradition on the Lima River.",
    "Surf, bodyboard, stand-up paddle":"Surf, bodyboard, stand-up paddle",
    "Referência no surf, bodyboard e SUP na região norte. Organiza eventos, forma atletas e promove a ligação ao mar.":"Reference in surf, bodyboard and SUP in the northern region. Organizes events, trains athletes and promotes the connection to the sea.",
    "Ver Todos os Clubes":"See All Clubs",

    "Definições":"Settings",
    "Alterar Tema":"Change Theme",
    "Alterar Idioma":"Change the language",
    "Idioma alterado com sucesso!":"Language changed successfully!"
}